controllers/SiteController.php

SELECT * FROM `meta` WHERE meta_key='russia_armoring'
SELECT * FROM `meta` WHERE meta_key='ussr_armoring'
SELECT * FROM `meta` WHERE meta_key='olympiad_armoring'
SELECT * FROM `things` WHERE category='russia'
SELECT * FROM `things` WHERE category='ussr'
SELECT * FROM `things` WHERE category='olympiad80'
---
    public function actionStorage()
    {

        $russiaArmoring = Meta::find()->where("meta_key='russia_armoring'")->one()->meta_value;
        $ussrArmoring = Meta::find()->where("meta_key='ussr_armoring'")->one()->meta_value;
        $olympiadArmoring = Meta::find()->where("meta_key='olympiad_armoring'")->one()->meta_value;

        $russiaNames = Things::find()->where("category='russia'")->all();
        $ussrNames = Things::find()->where("category='ussr'")->all();
        $olympiad80Names = Things::find()->where("category='olympiad80'")->all();

SELECT * FROM `things`
---
        }

        $allarticles = [];
        $artics = Things::find()->all();

SELECT * FROM `things` WHERE category='russia'
SELECT * FROM `things` WHERE category='ussr'
SELECT * FROM `things` WHERE category='olympiad80'
SELECT * FROM `things`
---
            $allarticles[$key->article] = $key->article;
        }

        $russia = Things::find()->where("category='russia'")->all();
        $ussr = Things::find()->where("category='ussr'")->all();
        $olympiad80 = Things::find()->where("category='olympiad80'")->all();
        $allclths = Things::find()->all();

SELECT * FROM `meta` WHERE meta_key='olympiad_armoring'
UPDATE `meta` SET `meta_value`=5 WHERE `meta_key`='olympiad_armoring'
SELECT * FROM `meta` WHERE meta_key='russia_armoring'
UPDATE `meta` SET `meta_value`=20 WHERE `meta_key`='russia_armoring'
---

                    for($i = 0; $i< count($dd); $i++){
                        if(strcmp($dd[$i]['brand'],"Олимпиада 80")==0){
                            $post = Meta::find()->where("meta_key='olympiad_armoring'")->one();
                            $post->meta_value+=1;
                            $post->save();
                        }else if(strcmp($dd[$i]['brand'],"Россия")==0){
                            $post = Meta::find()->where("meta_key='russia_armoring'")->one();
                            $post->meta_value+=1;
                            $post->save();

SELECT * FROM `meta` WHERE meta_key='russia_armoring'
UPDATE `meta` SET `meta_value`=22 WHERE `meta_key`='russia_armoring'
SELECT * FROM `things` WHERE article = ''
---
                                    $sizes->save();

                                }else if(strcmp($d[$i]['brand'],"Россия")==0){
                                    $post = Meta::find()->where("meta_key='russia_armoring'")->one();
                                    $post->meta_value-=1;
                                    $post->save();

                                    $post = Things::find()->where("article = '".$d2[$i]['name']."'")->one();